Documents/БезналичнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>БезналичнаяОперация</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Доходы</xr:Item>
				<xr:Item>AccumulationRegister.Сальдо</xr:Item>
				<xr:Item>AccumulationRegister.Касса</xr:Item>
				<xr:Item>InformationRegister.Задолженности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаВаловая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЧистая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обороты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Касса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сальдо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВаловая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЧистая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоБезналу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УчетПоНалу</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Сальдо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<AccumulationRegister>
		<Properties>
			<Name>Сальдо</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВзаиморасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВзаиморасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Примечания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоСписании</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыВзаиморасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыВзаиморасчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Нал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безнал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Терминал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БезналичнаяОперация/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура ОборотыЗаполнитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Сальдо.Контрагент КАК Контрагент,
	|	СУММА(Сальдо.СуммаОстаток) КАК Сумма
	|ИЗ
	|	РегистрНакопления.Сальдо.Остатки(&Дата, ТипВзаиморасчета = Значение(Перечисление.ТипыВзаиморасчета.Нал)) КАК Сальдо
	|ГДЕ
	|	ИСТИНА
	|СГРУППИРОВАТЬ ПО
	|	Сальдо.Контрагент
	|УПОРЯДОЧИТЬ ПО
	|	Сальдо.Контрагент.Наименование");

	Запрос.УстановитьПараметр("Дата", Объект.Дата - 1);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтарыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("Контрагент", ВыборкаКонтрагент.Контрагент));
		Если СтарыеСтроки.Количество() > 0 Тогда
			ТекСтрока = СтарыеСтроки[0];
		Иначе
			ТекСтрока = Объект.Обороты.Добавить();
			ТекСтрока.Ставка = 100;
			ТекСтрока.УчетПоНалу = Истина;
		КонецЕсли;
		
		ТекСтрока.Контрагент = ВыборкаКонтрагент.Контрагент;
		ТекСтрока.Сальдо = ВыборкаКонтрагент.Сумма;
	КонецЦикла;
	
	Объект.Обороты.Сортировать("Контрагент");
КонецПроцедуры

&НаКлиенте
Процедура ОборотыЗаполнить(Кнопка)
	ОборотыЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОборотыУдалитьПС(Кнопка)
	ПустыеСтроки = Объект.Обороты.НайтиСтроки(Новый Структура("СуммаВаловая,СуммаЧистая", 0, 0)); 
	Для Каждого Строка Из ПустыеСтроки Цикл 
		Объект.Обороты.Удалить(Строка); 
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОборотыКассаПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, ПредопределенноеЗначение("Перечисление.ТипыВзаиморасчета.Нал"), Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыКонтрагентПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.Сальдо = РаботаСКонтрагентами.Сальдо(ТекСтрока.Контрагент, ПредопределенноеЗначение("Перечисление.ТипыВзаиморасчета.Нал"), Объект.Дата);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСуммаВаловаяПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаЧистая = ТекСтрока.СуммаВаловая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСтавкаПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаЧистая = ТекСтрока.СуммаВаловая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыСуммаЧистаяПриИзменении(Элемент)
	ТекСтрока = Элементы.Обороты.ТекущиеДанные;
	ТекСтрока.СуммаВаловая = ТекСтрока.СуммаЧистая * (ТекСтрока.Ставка / 100);
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПослеУдаления(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ОборотыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтрока = Элементы.Обороты.ТекущиеДанные;
		ТекСтрока.Ставка = 100;
		ТекСтрока.УчетПоНалу = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
	СуммаВаловая = Объект.Обороты.Итог("СуммаВаловая");
	СуммаЧистая = Объект.Обороты.Итог("СуммаЧистая");
КонецПроцедуры
